<a href="https://colab.research.google.com/github/SonoPaulo/Basics/blob/learning/ML_1_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Ekstratacja cech

In [ ]:
#import bibliotek
import numpy as np
import pandas as pd
import sklearn

sklearn.__version__

In [4]:
#zaciągnięcie notować Amazona z Stooq
def fetch_financial_data(company='AMZN'):
    """
    This function fetches stock market quotations.
    """
    import pandas_datareader.data as web
    return web.DataReader(name=company, data_source='stooq')

df_raw = fetch_financial_data()
#metoda head pokazuje 5 pierwszych wierszy
df_raw.head()

               Open      High        Low    Close   Volume
Date
2021-11-19  3712.69  3762.145  3675.7200  3676.57  4946203
2021-11-18  3566.35  3704.200  3561.0000  3696.06  5703538
2021-11-17  3564.72  3587.245  3545.3500  3549.00  2560270
2021-11-16  3539.00  3576.500  3525.1466  3540.70  2217071
2021-11-15  3537.00  3593.880  3525.8100  3545.68  2929719

In [5]:
#utworzenie kopii danych
df = df_raw.copy()
df = df[:5]
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 2021-11-19 to 2021-11-15
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Open    5 non-null      float64
 1   High    5 non-null      float64
 2   Low     5 non-null      float64
 3   Close   5 non-null      float64
 4   Volume  5 non-null      int64
dtypes: float64(4), int64(1)
memory usage: 240.0 bytes

In [6]:
#generowanie nowych zmiennych
df.index.month

Int64Index([11, 11, 11, 11, 11], dtype='int64', name='Date')

In [8]:
df['day'] = df.index.day
df['month'] = df.index.month
df['year'] = df.index.year
df

               Open      High        Low    Close   Volume  day  month  year
Date
2021-11-19  3712.69  3762.145  3675.7200  3676.57  4946203   19     11  2021
2021-11-18  3566.35  3704.200  3561.0000  3696.06  5703538   18     11  2021
2021-11-17  3564.72  3587.245  3545.3500  3549.00  2560270   17     11  2021
2021-11-16  3539.00  3576.500  3525.1466  3540.70  2217071   16     11  2021
2021-11-15  3537.00  3593.880  3525.8100  3545.68  2929719   15     11  2021

#Dyskretyzacja zmiennej ciągłej

In [ ]:

#generujemy przykładowe dane na potrzebę nauki
df = pd.DataFrame(data={'height': [175., 178.5, 185., 191., 184.5, 183., 168.]})
df

In [10]:
#przedstawiamy naszą zmienną numeryczną jako zmienną kategoryczną. Bins = ile podziałów
df['height_cat'] = pd.cut(x=df.height, bins=3)
df

   height          height_cat
0   175.0  (167.977, 175.667]
1   178.5  (175.667, 183.333]
2   185.0    (183.333, 191.0]
3   191.0    (183.333, 191.0]
4   184.5    (183.333, 191.0]
5   183.0  (175.667, 183.333]
6   168.0  (167.977, 175.667]

In [11]:
#tutaj przedziały narzucone przez użytkownika
df['height_cat'] = pd.cut(x=df.height, bins=(160, 175, 180, 195))
df

   height  height_cat
0   175.0  (160, 175]
1   178.5  (175, 180]
2   185.0  (180, 195]
3   191.0  (180, 195]
4   184.5  (180, 195]
5   183.0  (180, 195]
6   168.0  (160, 175]

In [ ]:
#tutaj zamiast przedziału wyświetlamy etykietę parametrem labels
df['height_cat'] = pd.cut(x=df.height, bins=(160, 175, 180, 195), labels=['small', 'medium', 'high'])
df

In [12]:
#omawiana już wcześniej metoda get dummies przygotowuje dane do modelu
pd.get_dummies(df, drop_first=True, prefix='height')

   height  height_(175, 180]  height_(180, 195]
0   175.0                  0                  0
1   178.5                  1                  0
2   185.0                  0                  1
3   191.0                  0                  1
4   184.5                  0                  1
5   183.0                  0                  1
6   168.0                  0                  0

ekstratacja cech

In [13]:
df = pd.DataFrame(data={'lang': [['PL', 'ENG'], ['GER', 'ENG', 'PL', 'FRA'], ['RUS']]})
df

                  lang
0            [PL, ENG]
1  [GER, ENG, PL, FRA]
2                [RUS]

In [14]:
#tutaj ilość języków
#apply implementuje funkcje
df['lang_number'] = df['lang'].apply(len)
df

                  lang  lang_number
0            [PL, ENG]            2
1  [GER, ENG, PL, FRA]            4
2                [RUS]            1

In [15]:
#ilość jak wcześniej oraz flagowanie - czyli info gdzie występuje polski
df['PL_flag'] = df['lang'].apply(lambda x: 1 if 'PL' in x else 0)
df

                  lang  lang_number  PL_flag
0            [PL, ENG]            2        1
1  [GER, ENG, PL, FRA]            4        1
2                [RUS]            1        0

In [16]:
df = pd.DataFrame(data={'website': ['wp.pl', 'onet.pl', 'google.com']})
df

      website
0       wp.pl
1     onet.pl
2  google.com

In [17]:
#rozdzielanie po ograniczniku
df.website.str.split('.', expand=True)

        0    1
0      wp   pl
1    onet   pl
2  google  com

In [19]:
#do zmiennej new przepisujemy rezultat komendy z linii wcześniej
new = df.website.str.split('.', expand=True)
#jako zmienna dfportal przypiszemy pierwszą kolumnę
df['portal'] = new[0]
#...drugą kolumnnę
df['extension'] = new[1]
df

      website  portal extension
0       wp.pl      wp        pl
1     onet.pl    onet        pl
2  google.com  google       com